<?php
    /**
     * Created by PhpStorm.
     * User: Yeuoly SRM_XY
     * Date: 2019/1/26
     * Time: 17:25
     */

//--------------------------------------------------------------------------//
    /*
     * 用户权限设置
     *
     * */
    define("USER_POWER_ADMIN",2);

    define("USER_POWER_NORMAL",1);

    define("USER_POWER_INVALID",0);

//--------------------------------------------------------------------------//
    /*
     * 用户等级经验定义
     *
     * */
    function UserLvExp($lv){
        return pow(5,$lv) + $lv * 10;
    }

//--------------------------------------------------------------------------//
    /*
     *
     *
     * */
